export interface DataLenta {
    // userId: number;
    id: number;
    title: string;
    category:string;
    author:string;
    date:string;
    img:string;
    content:string;
    likes:number;
}
export const datas = [
    {
        id: 1,
        "author": "Dan Peck",
        "title": "Hurricane Hanna makes landfall around 5 p.m. on Saturday.",
        "img": "https://s.abcnews.com/images/US/hanna-swimmer-mo_hpMain_20200725-163152_2_4x3t_384.jpg",
        "category": "general",
        "date":"20.04.2023",
        "content":"Здесь просто какой-то ну очень интересный текст нужной вам статьи, описывающий возможно что-то настолько оригинальное и неописуемо необходимое текущему мироустройству, что автор сего непревзойденного труда не смогу найти в себе ни капельки сил, чтоб сдержать себя в творческом порыве создания сего шедевра и одарить нас информацией, столь фундаментальной, что основы мировозрения многих читателей не смогут устоять от перемен, навеяных музой вдохновения от данного текста.",
        likes:223,
    },
    {
        id: 2,
        "author": "TMZ Staff",
        "title": "Nicki Minaj's Husband Gets Permission To Be There For Baby's Birth",
        "img": "https://imagez.tmz.com/image/c1/4by3/2020/07/30/c115ad2dc849438a97a0ad3097b416df_md.jpg",
        "category": "general",
        "date":"21.04.2023",
        "content":"И, разумеется, ни для кого не будет сюрпризом тот факт, что у данного текста имеется продолжение в форме второго параграфа, призванного одарить нас познаниями столь монументальными, что великие умы прошлого не встанут ни в какое сравнение с вами, господа читатели сей статьи, ибо вы преисполнитесь в познании так, будо уже прожили миллионы и миллиарды жиней на триллионах и триллиардах планет таких, как эта Земля, вам этот мир станет абсолютно понятен",
        likes:223,
    },
    {
        id: 3,
        "author": "Michael Rothstein",
        "title": "New Lions safety Jayron Kearse suspended three games",
        "img": "https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2020%2F0111%2Fr651071_1296x729_16%2D9.jpg",
        "category": "sports",
        "date":"05.04.2023",
        "content":"И, разумеется, ни для кого не будет сюрпризом тот факт, что у данного текста имеется продолжение в форме второго параграфа, призванного одарить нас познаниями столь монументальными, что великие умы прошлого не встанут ни в какое сравнение с вами, господа читатели сей статьи, ибо вы преисполнитесь в познании так, будо уже прожили миллионы и миллиарды жиней на триллионах и триллиардах планет таких, как эта Земля, вам этот мир станет абсолютно понятен.",
        likes:223,
    },
]
